Revit 2027 API
TriangulatedShellComponent.TriangleCount Property
 The number of triangles in the triangulation.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int TriangleCount { get; }
Public ReadOnly Property TriangleCount As Integer
	Get
public:
property int TriangleCount {
	int get ();
}
member TriangleCount : int with get
Property Value
Int32
See Also
Reference
TriangulatedShellComponent Class
Autodesk.Revit.DB Namespace